"""
1. 掌握(熟悉)numpy的常用函数

2. opencv常用函数

3. 写数据增强方面的代码

"""

"""
数据类型：
1. 标量(只有一个数)  shape=(,)  dim = 0
   //const int a = 3;
   a = 3
   
2. 向量 vector  shape = (4,) dim = 1
   a = [1, 2, 3, 4, ...]
   
   轴,axis= 0

3. 矩阵matrix   shape = (2 x 3) dim = 2
   a = [
    [1,2,3],
    [2,3,4]
   ]
   轴 axis = 0
      axis = 1
   
4. 3维及以上 ->张量 tensor 
    
   shape = 1 x 2 x 3  dim = 3
   a = [
     [
        [1,2,3],
        [2,3,4]
     ]
   ] [ A ]
   A 
        [[1,2,3],
        [2,3,4]]
   轴 axis = 0
      axis = 1
      axis = 2
      
   
   shape = 2 x 2 x 3
   
   a = [
     [
        [1,2,3],
        [2,3,4]
     ],
     [
        [1,2,3],
        [2,3,4]
     ]
   ]
   
   aixs = 0 [ A, B]
   axis = 1 同时看到A和B里面的axis=0
   axis = 2 
   
   宇宙总物质是不变的，变的只是观察的维度不同
   客观物质是不会改变的，能改变的处理事物角度
   
   
   
   shape = 3 x 2 x 2 x 3 dim = 4
   
   axis = 0 -> 3个2x2x3 [A,B,C]
   axis = 1 -> 6个2x3
   axis = 2 -> 12个3 rows
   axis = 3 -> 18个2 cols
   
   a = [
       [
         [
            [1,2,3],
            [2,3,4]
         ],
         [
            [1,2,3],
            [2,3,4]
         ]
       ] ,
       [
         [
            [1,2,3],
            [2,3,4]
         ],
         [
            [1,2,3],
            [2,3,4]
         ]
       ] ,
       [
         [
            [1,2,3],
            [2,3,4]
         ],
         [
            [1,2,3],
            [2,3,4]
         ]
       ] ,
   ]









"""